```
krishna@turbotindias-MacBook-Pro gcp_check_public_access % terraform apply
var.turbot_profile
  Enter profile matching your turbot cli credentials.

  Enter a value: punisher

turbot_smart_folder.gcp_public_access: Refreshing state... [id=216698117253416]
turbot_policy_setting.instance_external_ip_addresses: Refreshing state... [id=216698121513525]
turbot_policy_setting.instance_block_project_wide_ssh_keys: Refreshing state... [id=216698121401879]
turbot_policy_setting.gcp_network_firewall_ingress_rules_approved_rules: Refreshing state... [id=216698121455141]
turbot_policy_setting.instance_serial_port_access: Refreshing state... [id=216698126166756]
turbot_policy_setting.gcp_network_firewall_ingress_rules_approved: Refreshing state... [id=216698123396769]
turbot_policy_setting.gcp_service_trusted_access["gcp-dataproc-workflowTemplate"]: Refreshing state... [id=216698127260413]
turbot_policy_setting.gcp_service_trusted_access["gcp-iam-projectIam"]: Refreshing state... [id=216698121656906]
turbot_policy_setting.gcp_service_trusted_access["gcp-network-subnetwork"]: Refreshing state... [id=216698124831444]
turbot_policy_setting.gcp_service_trusted_access["gcp-functions-function"]: Refreshing state... [id=216698121439774]
turbot_policy_setting.gcp_service_trusted_access["gcp-spanner-instance"]: Refreshing state... [id=216698127223533]
turbot_policy_setting.gcp_service_trusted_access["gcp-dataproc-cluster"]: Refreshing state... [id=216698127228656]
turbot_policy_setting.gcp_service_trusted_access["gcp-storage-bucket"]: Refreshing state... [id=216698121545277]
turbot_policy_setting.gcp_service_trusted_access["gcp-computeengine-nodeGroup"]: Refreshing state... [id=216698127245045]
turbot_policy_setting.gcp_service_trusted_access["gcp-kms-cryptoKey"]: Refreshing state... [id=216698124829394]
turbot_policy_setting.gcp_service_trusted_access["gcp-iam-serviceAccountPolicy"]: Refreshing state... [id=216698124870367]
turbot_policy_setting.gcp_service_trusted_access["gcp-computeengine-instanceTemplate"]: Refreshing state... [id=216698124825295]
turbot_policy_setting.gcp_service_trusted_access["gcp-kms-keyRing"]: Refreshing state... [id=216698127249144]
turbot_policy_setting.gcp_service_trusted_access["gcp-computeengine-nodeTemplate"]: Refreshing state... [id=216698124754622]
turbot_policy_setting.project_trusted_domains_template: Refreshing state... [id=216698121459238]
turbot_policy_setting.gcp_service_trusted_access["gcp-dataproc-job"]: Refreshing state... [id=216698121534010]
turbot_policy_setting.gcp_service_trusted_access["gcp-pubsub-topic"]: Refreshing state... [id=216698121085429]
turbot_policy_setting.gcp_service_trusted_access["gcp-bigtable-instance"]: Refreshing state... [id=216698124769993]
turbot_policy_setting.gcp_service_trusted_access["gcp-pubsub-subscription"]: Refreshing state... [id=216698124762818]
turbot_policy_setting.gcp_service_trusted_access["gcp-computeengine-disk"]: Refreshing state... [id=216698121507377]
turbot_policy_setting.gcp_service_trusted_access["gcp-computeengine-image"]: Refreshing state... [id=216698124850907]
turbot_policy_setting.gcp_service_trusted_access["gcp-computeengine-instance"]: Refreshing state... [id=216698124765893]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # turbot_policy_setting.gcp_network_firewall_ingress_rules_approved will be created
  + resource "turbot_policy_setting" "gcp_network_firewall_ingress_rules_approved" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-network#/policy/types/firewallIngressRulesApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.gcp_network_firewall_ingress_rules_approved_rules will be created
  + resource "turbot_policy_setting" "gcp_network_firewall_ingress_rules_approved_rules" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-network#/policy/types/firewallIngressRulesApprovedRules"
      + value                        = <<~EOT
              REJECT $.sourceRanges:0.0.0.0/0,::/0
              APPROVE *
        EOT
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.gcp_service_trusted_access["gcp-bigtable-instance"] will be created
  + resource "turbot_policy_setting" "gcp_service_trusted_access" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-bigtable#/policy/types/instancePolicyTrustedAccess"
      + value                        = "Check: Trusted Access > *"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.gcp_service_trusted_access["gcp-computeengine-disk"] will be created
  + resource "turbot_policy_setting" "gcp_service_trusted_access" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-computeengine#/policy/types/diskPolicyTrustedAccess"
      + value                        = "Check: Trusted Access > *"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.gcp_service_trusted_access["gcp-computeengine-image"] will be created
  + resource "turbot_policy_setting" "gcp_service_trusted_access" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-computeengine#/policy/types/imagePolicyTrustedAccess"
      + value                        = "Check: Trusted Access > *"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.gcp_service_trusted_access["gcp-computeengine-instance"] will be created
  + resource "turbot_policy_setting" "gcp_service_trusted_access" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-computeengine#/policy/types/instancePolicyTrustedAccess"
      + value                        = "Check: Trusted Access > *"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.gcp_service_trusted_access["gcp-computeengine-instanceTemplate"] will be created
  + resource "turbot_policy_setting" "gcp_service_trusted_access" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-computeengine#/policy/types/instanceTemplatePolicyTrustedAccess"
      + value                        = "Check: Trusted Access > *"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.gcp_service_trusted_access["gcp-computeengine-nodeGroup"] will be created
  + resource "turbot_policy_setting" "gcp_service_trusted_access" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-computeengine#/policy/types/nodeGroupPolicyTrustedAccess"
      + value                        = "Check: Trusted Access > *"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.gcp_service_trusted_access["gcp-computeengine-nodeTemplate"] will be created
  + resource "turbot_policy_setting" "gcp_service_trusted_access" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-computeengine#/policy/types/nodeTemplatePolicyTrustedAccess"
      + value                        = "Check: Trusted Access > *"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.gcp_service_trusted_access["gcp-dataproc-cluster"] will be created
  + resource "turbot_policy_setting" "gcp_service_trusted_access" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-dataproc#/policy/types/clusterPolicyTrustedAccess"
      + value                        = "Check: Trusted Access > *"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.gcp_service_trusted_access["gcp-dataproc-job"] will be created
  + resource "turbot_policy_setting" "gcp_service_trusted_access" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-dataproc#/policy/types/jobPolicyTrustedAccess"
      + value                        = "Check: Trusted Access > *"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.gcp_service_trusted_access["gcp-dataproc-workflowTemplate"] will be created
  + resource "turbot_policy_setting" "gcp_service_trusted_access" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-dataproc#/policy/types/workflowTemplatePolicyTrustedAccess"
      + value                        = "Check: Trusted Access > *"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.gcp_service_trusted_access["gcp-functions-function"] will be created
  + resource "turbot_policy_setting" "gcp_service_trusted_access" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-functions#/policy/types/functionPolicyTrustedAccess"
      + value                        = "Check: Trusted Access > *"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.gcp_service_trusted_access["gcp-iam-projectIam"] will be created
  + resource "turbot_policy_setting" "gcp_service_trusted_access" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-iam#/policy/types/projectIamPolicyTrustedAccess"
      + value                        = "Check: Trusted Access > *"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.gcp_service_trusted_access["gcp-iam-serviceAccountPolicy"] will be created
  + resource "turbot_policy_setting" "gcp_service_trusted_access" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-iam#/policy/types/serviceAccountPolicyTrustedAccess"
      + value                        = "Check: Trusted Access > *"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.gcp_service_trusted_access["gcp-kms-cryptoKey"] will be created
  + resource "turbot_policy_setting" "gcp_service_trusted_access" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-kms#/policy/types/cryptoKeyPolicyTrustedAccess"
      + value                        = "Check: Trusted Access > *"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.gcp_service_trusted_access["gcp-kms-keyRing"] will be created
  + resource "turbot_policy_setting" "gcp_service_trusted_access" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-kms#/policy/types/keyRingPolicyTrustedAccess"
      + value                        = "Check: Trusted Access > *"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.gcp_service_trusted_access["gcp-network-subnetwork"] will be created
  + resource "turbot_policy_setting" "gcp_service_trusted_access" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-network#/policy/types/subnetworkPolicyTrustedAccess"
      + value                        = "Check: Trusted Access > *"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.gcp_service_trusted_access["gcp-pubsub-subscription"] will be created
  + resource "turbot_policy_setting" "gcp_service_trusted_access" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-pubsub#/policy/types/subscriptionPolicyTrustedAccess"
      + value                        = "Check: Trusted Access > *"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.gcp_service_trusted_access["gcp-pubsub-topic"] will be created
  + resource "turbot_policy_setting" "gcp_service_trusted_access" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-pubsub#/policy/types/topicPolicyTrustedAccess"
      + value                        = "Check: Trusted Access > *"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.gcp_service_trusted_access["gcp-spanner-instance"] will be created
  + resource "turbot_policy_setting" "gcp_service_trusted_access" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-spanner#/policy/types/instancePolicyTrustedAccess"
      + value                        = "Check: Trusted Access > *"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.gcp_service_trusted_access["gcp-storage-bucket"] will be created
  + resource "turbot_policy_setting" "gcp_service_trusted_access" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-storage#/policy/types/bucketPolicyTrustedAccess"
      + value                        = "Check: Trusted Access > *"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.instance_block_project_wide_ssh_keys will be created
  + resource "turbot_policy_setting" "instance_block_project_wide_ssh_keys" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-computeengine#/policy/types/instanceBlockProjectWideSshKeys"
      + value                        = "Check: Enabled"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.instance_external_ip_addresses will be created
  + resource "turbot_policy_setting" "instance_external_ip_addresses" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-computeengine#/policy/types/instanceExternalIpAddresses"
      + value                        = "Check: None"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.instance_serial_port_access will be created
  + resource "turbot_policy_setting" "instance_serial_port_access" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp-computeengine#/policy/types/instanceSerialPortAccess"
      + value                        = "Check: Enabled"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.project_trusted_domains_template will be created
  + resource "turbot_policy_setting" "project_trusted_domains_template" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/gcp#/policy/types/trustedDomains"
      + value                        = <<~EOT
            - "*" # allows all, adjust for specific domains (e.g. gmail.com, turbot.com)
            - "turbot.com" #example of setting a specific domain
        EOT
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_smart_folder.gcp_public_access will be created
  + resource "turbot_smart_folder" "gcp_public_access" {
      + description = "Defines sets of policies for GCP Check Public Access baseline"
      + id          = (known after apply)
      + parent      = "tmod:@turbot/turbot#/"
      + parent_akas = (known after apply)
      + title       = "GCP Check Public Access Policies"
    }

Plan: 27 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + gcp_network_firewall_ingress_rules_approved = "Check: Approved"
  + gcp_service_trusted_access                  = "Check: Trusted Access > *"
  + instance_serial_port_access                 = "Check: Enabled"
  + smart_folder_description                    = "Defines sets of policies for GCP Check Public Access baseline"
  + smart_folder_name                           = "GCP Check Public Access Policies"
  + smart_folder_parent_resource                = "tmod:@turbot/turbot#/"
  + turbot_profile                              = "punisher"

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

turbot_smart_folder.gcp_public_access: Creating...
turbot_smart_folder.gcp_public_access: Creation complete after 1s [id=216702024178741]
turbot_policy_setting.gcp_service_trusted_access["gcp-kms-keyRing"]: Creating...
turbot_policy_setting.gcp_service_trusted_access["gcp-computeengine-nodeGroup"]: Creating...
turbot_policy_setting.gcp_service_trusted_access["gcp-dataproc-cluster"]: Creating...
turbot_policy_setting.gcp_service_trusted_access["gcp-computeengine-image"]: Creating...
turbot_policy_setting.gcp_service_trusted_access["gcp-storage-bucket"]: Creating...
turbot_policy_setting.gcp_service_trusted_access["gcp-computeengine-instanceTemplate"]: Creating...
turbot_policy_setting.gcp_service_trusted_access["gcp-network-subnetwork"]: Creating...
turbot_policy_setting.instance_block_project_wide_ssh_keys: Creating...
turbot_policy_setting.gcp_service_trusted_access["gcp-bigtable-instance"]: Creating...
turbot_policy_setting.gcp_service_trusted_access["gcp-dataproc-job"]: Creating...
turbot_policy_setting.gcp_service_trusted_access["gcp-computeengine-nodeGroup"]: Creation complete after 3s [id=216702027834437]
turbot_policy_setting.gcp_service_trusted_access["gcp-dataproc-cluster"]: Creation complete after 3s [id=216702027814974]
turbot_policy_setting.instance_external_ip_addresses: Creating...
turbot_policy_setting.gcp_service_trusted_access["gcp-computeengine-nodeTemplate"]: Creating...
turbot_policy_setting.gcp_service_trusted_access["gcp-kms-keyRing"]: Creation complete after 4s [id=216702027813949]
turbot_policy_setting.gcp_service_trusted_access["gcp-iam-projectIam"]: Creating...
turbot_policy_setting.gcp_service_trusted_access["gcp-dataproc-job"]: Creation complete after 4s [id=216702029707348]
turbot_policy_setting.gcp_service_trusted_access["gcp-spanner-instance"]: Creating...
turbot_policy_setting.gcp_service_trusted_access["gcp-computeengine-image"]: Creation complete after 6s [id=216702029640780]
turbot_policy_setting.gcp_service_trusted_access["gcp-network-subnetwork"]: Creation complete after 6s [id=216702029687888]
turbot_policy_setting.instance_external_ip_addresses: Creation complete after 3s [id=216702031147109]
turbot_policy_setting.gcp_service_trusted_access["gcp-computeengine-disk"]: Creating...
turbot_policy_setting.gcp_service_trusted_access["gcp-pubsub-subscription"]: Creating...
turbot_policy_setting.gcp_service_trusted_access["gcp-functions-function"]: Creating...
turbot_policy_setting.gcp_service_trusted_access["gcp-computeengine-nodeTemplate"]: Creation complete after 4s [id=216702030414940]
turbot_policy_setting.gcp_service_trusted_access["gcp-pubsub-topic"]: Creating...
turbot_policy_setting.instance_block_project_wide_ssh_keys: Creation complete after 8s [id=216702031765609]
turbot_policy_setting.instance_serial_port_access: Creating...
turbot_policy_setting.gcp_service_trusted_access["gcp-iam-projectIam"]: Creation complete after 4s [id=216702033870971]
turbot_policy_setting.gcp_network_firewall_ingress_rules_approved: Creating...
turbot_policy_setting.gcp_service_trusted_access["gcp-storage-bucket"]: Still creating... [10s elapsed]
turbot_policy_setting.gcp_service_trusted_access["gcp-computeengine-instanceTemplate"]: Still creating... [10s elapsed]
turbot_policy_setting.gcp_service_trusted_access["gcp-bigtable-instance"]: Still creating... [10s elapsed]
turbot_policy_setting.gcp_service_trusted_access["gcp-computeengine-instanceTemplate"]: Creation complete after 10s [id=216702030535776]
turbot_policy_setting.gcp_service_trusted_access["gcp-dataproc-workflowTemplate"]: Creating...
turbot_policy_setting.gcp_service_trusted_access["gcp-computeengine-disk"]: Creation complete after 6s [id=216702036927617]
turbot_policy_setting.project_trusted_domains_template: Creating...
turbot_policy_setting.gcp_service_trusted_access["gcp-functions-function"]: Creation complete after 6s [id=216702032748662]
turbot_policy_setting.gcp_service_trusted_access["gcp-storage-bucket"]: Creation complete after 12s [id=216702031881325]
turbot_policy_setting.gcp_service_trusted_access["gcp-kms-cryptoKey"]: Creating...
turbot_policy_setting.gcp_service_trusted_access["gcp-iam-serviceAccountPolicy"]: Creating...
turbot_policy_setting.gcp_service_trusted_access["gcp-bigtable-instance"]: Creation complete after 13s [id=216702032102513]
turbot_policy_setting.gcp_service_trusted_access["gcp-computeengine-instance"]: Creating...
turbot_policy_setting.gcp_service_trusted_access["gcp-spanner-instance"]: Still creating... [10s elapsed]
turbot_policy_setting.gcp_service_trusted_access["gcp-pubsub-subscription"]: Still creating... [10s elapsed]
turbot_policy_setting.gcp_service_trusted_access["gcp-iam-serviceAccountPolicy"]: Creation complete after 5s [id=216702039662728]
turbot_policy_setting.gcp_service_trusted_access["gcp-computeengine-instance"]: Creation complete after 4s [id=216702040272013]
turbot_policy_setting.gcp_service_trusted_access["gcp-dataproc-workflowTemplate"]: Creation complete after 7s [id=216702040863890]
turbot_policy_setting.gcp_network_firewall_ingress_rules_approved_rules: Creating...
turbot_policy_setting.gcp_service_trusted_access["gcp-pubsub-topic"]: Still creating... [10s elapsed]
turbot_policy_setting.instance_serial_port_access: Still creating... [10s elapsed]
turbot_policy_setting.gcp_network_firewall_ingress_rules_approved: Still creating... [10s elapsed]
turbot_policy_setting.project_trusted_domains_template: Creation complete after 7s [id=216702044623020]
turbot_policy_setting.gcp_service_trusted_access["gcp-spanner-instance"]: Creation complete after 15s [id=216702042657943]
turbot_policy_setting.instance_serial_port_access: Creation complete after 12s [id=216702043374753]
turbot_policy_setting.gcp_service_trusted_access["gcp-pubsub-subscription"]: Creation complete after 14s [id=216702043213979]
turbot_policy_setting.gcp_network_firewall_ingress_rules_approved_rules: Creation complete after 3s [id=216702044636336]
turbot_policy_setting.gcp_service_trusted_access["gcp-kms-cryptoKey"]: Creation complete after 8s [id=216702043950246]
turbot_policy_setting.gcp_service_trusted_access["gcp-pubsub-topic"]: Creation complete after 13s [id=216702046358712]
turbot_policy_setting.gcp_network_firewall_ingress_rules_approved: Creation complete after 14s [id=216702045643956]

Apply complete! Resources: 27 added, 0 changed, 0 destroyed.

Outputs:

gcp_network_firewall_ingress_rules_approved = Check: Approved
gcp_service_trusted_access = Check: Trusted Access > *
instance_serial_port_access = Check: Enabled
smart_folder_description = Defines sets of policies for GCP Check Public Access baseline
smart_folder_name = GCP Check Public Access Policies
smart_folder_parent_resource = tmod:@turbot/turbot#/
turbot_profile = punisher